<style>
    #introduction > p{
        direction: rtl;
        font-family: Vazir;
    }
    #introduction > p:first-child{
        font-size: 15pt;
        font-family: Vazir;
        direction: rtl;

    }



    #introduction{
        float: right;
        width: 1180px;
        margin-top: 20px;
        padding:10px;
        height: 430px;
        margin-bottom: 20px;
    }
    #introduction{
        background-color: white;
        position: relative;
        overflow: hidden;
    }
    #introduction .showmore{
        display: block;
        text-align: center;
        position: absolute;
        font-family: Vazir;
        top: 400px;
        width: 100%;
    }
    #introduction.active{
        height: auto!important;
    }
</style>
<div id="introduction">
    <p>معرفی اجمالی محصول</p>
    <a class="showmore">نمایش بیشتر</a>
    <?php print_r($productInfo['introduction']); ;?>
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
<!--    <p>توضیحاتی راجع به محصول</p>-->
</div>
<script>
    $('#introduction .showmore').click(function () {
        $('#introduction').toggleClass('active');
        $(this).hide();
    });

</script>